Tekla Open API Reference for Tekla Structures 2025
BasePoint.GetCompoundPlaneAngleLongitude Method
 Gets the Longitude as a compound plane angle.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Tuple<bool, int, int, int> GetCompoundPlaneAngleLongitude()
Public Function GetCompoundPlaneAngleLongitude As Tuple(Of Boolean, Integer, Integer, Integer)
Return Value
Type: Tuple<Boolean, Int32, Int32, Int32>
compound plane angle integers. The first param is true, if the value successfully calculated.
See Also
Reference
BasePoint Class
Tekla.Structures.Model Namespace